Catalogs/Renault_НастройкиСписков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_НастройкиСписков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_НастройкиСписков/Forms/СохранениеНастройки/Ext/Form/Module.bsl
// { ----------------------------------------------- обработка событий элементов диалога 

&НаКлиенте
Процедура ТаблицаНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "Пользователь" Тогда
		СтандартнаяОбработка = Ложь;
		ПерезаписатьСуществующуюНастройку(Команды.Найти("ПерезаписатьСуществующуюНастройку"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные.ИспользоватьПриОткрытии Тогда
		Для каждого Настройка Из ТаблицаНастроек Цикл
			Если Настройка.ИспользоватьПриОткрытии И НЕ Настройка = ТекДанные Тогда
				Настройка.ИспользоватьПриОткрытии = Ложь;
				Настройка.НастройкаИзменена = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ТекДанные.НастройкаИзменена = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПередУдалением(Элемент, Отказ)
	УдалитьНастройку(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

// }

// { ----------------------------------------------- команды

&НаКлиенте
Процедура ПерезаписатьСуществующуюНастройку(Команда)
	ТекДанные = Элементы.ТаблицаНастроек.ТекущиеДанные;
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("Ссылка",ТекДанные.Ссылка);
	РезультатВыбора.Вставить("КлючОбъекта", НастройкиКлючОбъекта);
	РезультатВыбора.Вставить("Наименование", ТекДанные.Наименование);
	РезультатВыбора.Вставить("ИспользоватьПриОткрытии", ТекДанные.ИспользоватьПриОткрытии);
	РезультатВыбора.Вставить("СохранятьАвтоматически", ТекДанные.СохранятьАвтоматически);
	Закрыть(РезультатВыбора);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюНастройку(Команда)
	
	Если ИспользоватьПриОткрытии Тогда
		Для каждого Настройка Из ТаблицаНастроек Цикл
			Если Настройка.ИспользоватьПриОткрытии Тогда
				Настройка.ИспользоватьПриОткрытии = Ложь;
				Настройка.НастройкаИзменена = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("Ссылка",Неопределено);
	РезультатВыбора.Вставить("КлючОбъекта", НастройкиКлючОбъекта);
	РезультатВыбора.Вставить("Наименование", НаименованиеНовойНастройки);
	РезультатВыбора.Вставить("ИспользоватьПриОткрытии", ИспользоватьПриОткрытии);
	РезультатВыбора.Вставить("СохранятьАвтоматически", СохранятьАвтоматически);
	Закрыть(РезультатВыбора);
	
КонецПроцедуры

// }

// { ----------------------------------------------- предопределенные

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиКлючОбъекта = Параметры.КлючОбъекта;

	тзНастройки = Renault_унсСервер.ПолучитьТаблицуНастроек(НастройкиКлючОбъекта);
	Для каждого Настройка Из тзНастройки Цикл
		НоваяСтрока = ТаблицаНастроек.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Настройка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	МассивИзмененныхНастроек = Новый Массив;
	
	Для каждого Настройка Из ТаблицаНастроек Цикл
		Если Настройка.НастройкаИзменена Тогда
			//Сообщить("Настройка " + Настройка.КлючНастройкиИсходный + " изменена");
			СтруктураНастройки = Новый Структура("
			|Ссылка,
			|Наименование,
			|ИспользоватьПриОткрытии,
			|СохранятьАвтоматически",
			Настройка.Ссылка,
			Настройка.Наименование,
			Настройка.ИспользоватьПриОткрытии,
			Настройка.СохранятьАвтоматически);
			МассивИзмененныхНастроек.Добавить(СтруктураНастройки);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивИзмененныхНастроек.Количество() > 0 Тогда
		СохранитьИзмененияНастроек(НастройкиКлючОбъекта, МассивИзмененныхНастроек)
	КонецЕсли;
	
КонецПроцедуры

// }

// { ----------------------------------------------- служебные

&НаСервереБезКонтекста
Процедура СохранитьИзмененияНастроек( пКлючОбъекта, пМассивИзмененныхНастроек )
	
	ТекПользователь = ПараметрыСеанса.Пользователь;
	
	Для каждого Настройка Из пМассивИзмененныхНастроек Цикл
		НастройкаОбъект = Настройка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(НастройкаОбъект,Настройка);
		НастройкаОбъект.КлючОбъекта 	= пКлючОбъекта;
		НастройкаОбъект.Пользователь 	= ТекПользователь;
		НастройкаОбъект.Записать();
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьНастройку( пНастройкаСсылка )	
	НастройкаОбъект = пНастройкаСсылка.ПолучитьОбъект();
	НастройкаОбъект.Удалить();
КонецПроцедуры

// }
